      *----------------------------------------------------------------*
       IDENTIFICATION DIVISION.
      *----------------------------------------------------------------*

       PROGRAM-ID. CLIENTES.

      *----------------------------------------------------------------*
      *                                                                *
      * PROGRAMA : CLIENTES                                            *
      *     TIPO : FUNCIONAL                                           *
      *                                                                *
      * ANALISTA : VITOR MARTINS LYRA                                  *
      *     DATA : 22/04/2020                                          *
      *                                                                *
      * OBJETIVO : CRIAR O MENU PRINCIPAL                              *
      * PROJETO  : SISTEMA DE GESTAO DE CLIENTES                       *
      *----------------------------------------------------------------*
      *                                                                *
      * MODULOS CHAMADOS:                                              *
      *                                                                *
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       ENVIRONMENT DIVISION.
      *----------------------------------------------------------------*
      *----------------------------------------------------------------*
       DATA DIVISION.
      *----------------------------------------------------------------*
      *----------------------------------------------------------------*
       WORKING-STORAGE SECTION.
      *----------------------------------------------------------------*

       77 WRK-OPCAO                     PIC X(001) VALUE SPACES.
       77 WRK-MODULO                    PIC X(025) VALUE SPACES.
       77 WRK-TECLA                     PIC X(001) VALUE SPACES.
       77 WRK-OPCAO-RELATO              PIC X(001) VALUE SPACES.

      *----------------------------------------------------------------*
       SCREEN SECTION.
      *----------------------------------------------------------------*
       01 SCR-TELA.
          05 SCR-LIMPRA-TELA.
             10 BLANK SCREEN.
             10 LINE 01 COLUMN 01 ERASE EOL
                BACKGROUND-COLOR 3.
             10 LINE 01 COLUMN 25 PIC X(20)
                BACKGROUND-COLOR 3 FOREGROUND-COLOR 0
                           FROM 'SISTEMA DE CLIENTES'.
             10 LINE 02 COLUMN 01 PIC X(25) ERASE EOL
                BACKGROUND-COLOR 1 FROM WRK-MODULO.

       01 SCR-MENU.
          05 LINE 07 COLUMN 15 VALUE '1 - INCLUIR'.
          05 LINE 08 COLUMN 15 VALUE '2 - CONSULTAR'.
          05 LINE 09 COLUMN 15 VALUE '3 - ALTERAR'.
          05 LINE 10 COLUMN 15 VALUE '4 - EXCLUIR'.
          05 LINE 11 COLUMN 15 VALUE '5 - RELATORIO'.
          05 LINE 12 COLUMN 15 VALUE 'X - SAIDA'.
          05 LINE 13 COLUMN 15 VALUE 'OPCAO......: '.
          05 LINE 13 COLUMN 28 USING WRK-OPCAO.

       01 SRC-RELATO.
          05 LINE 12 COLUMN 55 VALUE '1 - EM TELA'.
          05 LINE 13 COLUMN 55 VALUE '2 - EM DISCO'.
          05 LINE 14 COLUMN 55 VALUE 'OPCAO......: ' .
          05 LINE 14 COLUMN 68 USING WRK-OPCAO-RELATO.

      *----------------------------------------------------------------*
       PROCEDURE DIVISION.
      *----------------------------------------------------------------*
      *----------------------------------------------------------------*
       0000-INICIAR SECTION.
      *----------------------------------------------------------------*

           PERFORM 1000-INICIAR.
           PERFORM 2000-PROCESSAR.
           PERFORM 9000-FINALIZAR.

           STOP RUN.

      *----------------------------------------------------------------*
       0000-99-FIM. EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       1000-INICIAR SECTION.
      *----------------------------------------------------------------*

           DISPLAY SCR-TELA.
           ACCEPT SCR-MENU.

      *----------------------------------------------------------------*
       1000-99-FIM. EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2000-PROCESSAR SECTION.
      *----------------------------------------------------------------*

           EVALUATE WRK-OPCAO
               WHEN 1
                 PERFORM 2100-INCLUIR
               WHEN 2
                 CONTINUE
               WHEN 3
                 CONTINUE
               WHEN 4
                 CONTINUE
               WHEN 5
                 ACCEPT SRC-RELATO
                 IF WRK-OPCAO-RELATO EQUAL 1
                    PERFORM 2600-RELATORIO-TELA
                 ELSE
                    PERFORM 2700-RELATORIO-DISCO
                 END-IF
               WHEN OTHER
                 IF WRK-OPCAO NOT EQUAL 'X'
                    DISPLAY 'ENTRE COM A OPCAO CORRETA'
                 END-IF
           END-EVALUATE.

      *----------------------------------------------------------------*
       2000-99-FIM. EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2100-INCLUIR SECTION.
      *----------------------------------------------------------------*

           MOVE 'MODULO - INCLUSAO ' TO WRK-MODULO.
           DISPLAY SCR-TELA.
           ACCEPT WRK-TECLA AT 1620.

      *----------------------------------------------------------------*
       2100-99-FIM. EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2600-RELATORIO-TELA SECTION.
      *----------------------------------------------------------------*

           CONTINUE.

      *----------------------------------------------------------------*
       2600-99-FIM. EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       2700-RELATORIO-DISCO SECTION.
      *----------------------------------------------------------------*

           CONTINUE.

      *----------------------------------------------------------------*
       2700-99-FIM. EXIT.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       9000-FINALIZAR SECTION.
      *----------------------------------------------------------------*

           CONTINUE.

      *----------------------------------------------------------------*
       9000-99-FIM. EXIT.
      *----------------------------------------------------------------*
